[
    "My girlfriend broke up with me so I took her wheelchair. Guess who came crawling back.",
    "About a month before he died, my uncle had his back covered in lard. After that, he went down hill fast.",
    "Just burned 2,000 calories. That's the last time I leave brownies in the oven while I nap.",
    "The first computer dates back to Adam and Eve. It was an Apple with limited memory, just one byte. And then everything crashed.",
    "A mexican magician was doing a magic trick. He said, Uno, Dose, and he disappeared without a trace",
    "My girlfriend told me she was leaving me because I keep pretending to be a Transformer. I said, \"No, wait! I can change.\"",
    "My dad died when we couldn't remember his blood type. As he died, he kept insisting for us to \"be positive,\" but it's hard without him.",
    "eBay is so useless. I tried to look up lighters and all they had was 13,749 matches.",
    "I accidentally handed my wife a glue stick instead of a chapstick. She still isn't talking to me.",
    "I can't believe I got fired from the calendar factory. All I did was take a day off.",
    "Don't spell part backwards. It's a trap.",
    "I'm reading a book about anti-gravity. It's impossible to put down.",
    "My boss is going to fire the employee with the worst posture. I have a hunch, it might be me.",
    "I wasn't originally going to get a brain transplant, but then I changed my mind.",
    "Don't trust atoms, they make up everything.",
    "Thanks for explaining the word \"many\" to me, it means a lot.",
    "Q: What do you call the security outside of a Samsung Store? A: Guardians of the Galaxy.",
    "Most people are shocked when they find out how bad I am as an electrician",
    "I got a new pair of gloves today, but they're both 'lefts' which, on the one hand, is great, but on the other, it's just not right.",
    "Atheism is a non-prophet organization.",
    "R.I.P boiled water. You will be mist.",
    "Did you hear about the guy who got hit in the head with a can of soda? He was lucky it was a soft drink.",
    "The future, the present and the past walked into a bar. Things got a little tense.",
    "How did I escape Iraq? Iran.",
    "What is the best thing about living in Switzerland? Well, the flag is a big plus.",
    "I just found out I'm colorblind. The diagnosis came completely out of the purple.",
    "I bought some shoes from a drug dealer. I don't know what he laced them with, but I've been tripping all day.",
    "I was addicted to the hokey pokey... but thankfully, I turned myself around.",
    "What's the difference of deer nuts and beer nuts? Beer nuts are a $1.75, but deer nut are under a buck.",
    "I'd tell you a chemistry joke but I know I wouldn't get a reaction.",
    "Why was Cinderella thrown off the basketball team? She ran away from the ball.",
    "I saw an ad for burial plots, and thought to myself this is the last thing I need.",
    "To the mathematicians who thought of the idea of zero, thanks for nothing!",
    "Atheists don't solve exponential equations because they don't believe in higher powers.",
    "Claustrophobic people are more productive thinking out of the box.",
    "I have a few jokes about unemployed people but it doesn't matter none of them work.",
    "A cop just knocked on my door and told me that my dogs were chasing people on bikes. My dogs don't even own bikes...",
    "I'm emotionally constipated. I haven't given a shit in days.",
    "I'm glad I know sign language, it's pretty handy.",
    "My wife likes it when I blow air on her when she's hot, but honestly... I'm not a fan.",
    "Why do the French eat snails? They don't like fast food.",
    "Thieves had broken into my house and stolen everything except my soap, shower gel, towels and deodorant. Dirty Bastards.",
    "What did E.T.'s mother say to him when he got home? \"Where on Earth have you been?!\"",
    "I ordered 2000 lbs. of chinese soup. It was Won Ton.",
    "What's the difference between a poorly dressed man on a bicycle and a nicely dressed man on a tricycle? A tire.",
    "If a child refuses to sleep during nap time, are they guilty of resisting a rest?",
    "I couldn't quite remember how to throw a boomerang, but eventually, it came back to me.",
    "A courtroom artist was arrested today for an unknown reason... details are sketchy.",
    "I worked in the woods as a lumberjack, but I just couldn't hack it, so they gave me the ax.",
    "When I lose the TV controller, it's always hidden in some remote destination.",
    "Oxygen is proven to be a toxic gas. Anyone who inhales oxygen will normally dies within 80 years.",
    "If 4 out of 5 people SUFFER from diarrhea... does that mean that one enjoys it?",
    "I used to be addicted to soap, but I'm clean now.",
    "A friend of mine tried to annoy me with bird puns, but I soon realized that toucan play at that game.",
    "To write with a broken pencil is pointless.",
    "I've just written a song about tortillas - actually, it's more of a rap.",
    "My girlfriend said, \"You act like a detective too much. I want to split up.\" \"Good idea,\" I replied. \"We can cover more ground that way.\"",
    "When I get naked in the bathroom, the shower usually gets turned on.",
    "My boss told me to have a good day. So I went home.",
    "My first job was working in an orange juice factory, but I got canned: couldn't concentrate.",
    "Someone stole my toilet and the police have nothing to go on.",
    "My best mates and I played a game of hiding and seek. It went on for hours... Well, good friends are hard to find.",
    "If a short psychic broke out of jail, then you'd have a small medium at large.",
    "A book just fell on my head. I've only got myshelf to blame.",
    "I tried to escape the Apple store. I couldn't because there were no Windows.",
    "A termite walks into a bar and says, \"Where is the bar tender?\"",
    "I bought a dictionary and when I got home I realized all the pages were blank; I have no words for how angry I am.",
    "My math teacher called me average. How mean!",
    "Confucius say, man who runs behind car will get exhausted, but man who runs in front of car will get tired.",
    "Dr.'s are saying not to worry about the bird flu because it's tweetable.",
    "I don't engage in mental combat with the unarmed.",
    "This morning some clown opened the door for me. I thought to myself that's a nice Jester.",
    "I overdosed on Viagra once. The hardest day of my life.",
    "I am on a seafood diet. Every time I see food, I eat it.",
    "I'm no photographer, but I can picture us together.",
    "Why don't aliens visit our planet? Terrible ratings. One star.",
    "What do you have to do to have a party in space? You have to Planet.",
    "Not all math puns are terrible. Just sum.",
    "Why couldn't the leopard play hide and seek? Because he was always spotted.",
    "Why did the scientist install a knocker on his door? He wanted to win the No-bell prize!",
    "What was Forrest Gump's email password? \"1forrest1\"",
    "Did you hear about the man who jumped off a bridge in France? He was in Sein.",
    "Why do seagulls fly over the sea? Because if they flew over the bay they'd be bagels!",
    "I found a rock yesterday which measured 1760 yards in length. Must be some kind of milestone.",
    "Heard about the drug addict fisherman who accidentally caught a duck? Now he's hooked on the quack.",
    "Did you hear about that guy who fell into the infinity pool? Yeah... it took him forever to get out.",
    "What do you call a laughing motorcycle? A Yamahahaha.",
    "If you believe that the quickest way to a man's heart is the stomach, you know that you are aiming a little too high.",
    "Welcome to backhanded compliment club, it's so nice meeting people who don't care how they look.",
    "With great reflexes comes great response ability.",
    "What happens if you eat yeast and shoe polish? Every morning you will rise and shine!",
    "I relish the fact that you've mustard the strength to ketchup to me.",
    "For Halloween we dressed up as almonds. Everyone could tell we were nuts.",
    "I threw an Asian man down a flight of stairs. It was Wong on so many levels.",
    "What do you call a dictionary on drugs? HIGH-Definition.",
    "A teacher asks a student, \"Are you ignorant or just apathetic?\" The kid answers, \"I don't know and I don't care.\"",
    "I used to be a banker, but then I lost interest.",
    "Sign at the Urologist's office: URINE good hands.",
    "Justice is a dish best served cold because if it were served warm, it would be justwater.",
    "It's been raining for 3 days without stopping. My wife is in depression, she is standing and looking through the window. If the rain doesn't stop tomorrow, I'll have to let her in.",
    "Police have arrested the World tongue-twister Champion. I imagine he'll be given a tough sentence.",
    "I had a neck brace fitted years ago and I've never looked back since.",
    "I wanna make a joke about sodium, but Na..",
    "What do you call a cow with no legs? Ground beef.",
    "Did you hear about the monkeys who shared an Amazon account? They were prime mates.",
    "I hate peer pressure and you should too.",
    "A bus station is where a bus stops. A train station is where a train stops. On my desk, I have a work station..",
    "Got my girlfriend a \"get better soon\" card. She's not sick, I just think she could get better.",
    "My girlfriend tried to make me have sex on the hood of her Honda Civic. I refused. If I'm going to have sex, it's going to be on my own Accord.",
    "Did you hear about these new reversible jackets? I'm excited to see how they turn out.",
    "A huge thanks to the guy that just explained the word \"many\" to me. It means a lot.",
    "Last time I got caught stealing a calendar I got 12 months.",
    "Someone broke into my house last night and stole my Limbo stick. How low can you get?",
    "My psychiatrist said I was pre-occupied with the vengeance I told him \"oh yeah we'll see about that!\"",
    "I bought a box of condoms earlier today. The cashier asked if I'd like a bag. I said \"nah, I'll just turn the lights off.\"",
    "My boss says I intimidate the other employees, so I just stared at him until he apologized.",
    "Can a kangaroo jump higher than the Empire State Building? Of course. The Empire State Building can't jump.",
    "Why couldn't the bike stand up on it's own? It was two tired.",
    "My doctors office has two doctors on call at all times. Is that considered a pair a docs.",
    "You can't get on the same page with someone who has a different book.",
    "Did you hear about the Italian chef with a terminal illness? He pastaway.",
    "My grandfather tried to warn them about the Titanic. He screamed and shouted about the iceberg and how the ship was going to sink, but all they did was throw him out of the theater.",
    "What do you call people who are afraid of Santa Claus? Claustrophobic",
    "How did Jesus' crucifixion save us? It's 'cause he nailed it!",
    "Having sex in an elevator is wrong on so many levels.",
    "The therapist asked my wife why she wanted to end our marriage. She said she hated all the constant Star Wars puns. I look at the therapist and said, \"Divorce is strong with this one!\"",
    "I finally realized my parents favored my twin brother. It hit me when they asked me to blow up balloons for his surprise birthday party.",
    "What do you call a priest that becomes a lawyer? A father in law.",
    "What do prisoners use to call each other? Cell phones.",
    "What did one eye say to the other eye? Between you and me something smells.",
    "People don't get my puns. They think they're funny.",
    "Did you hear about the depressed plumber? He's been going through some shit.",
    "I was born to be a pessimist. My blood type is B Negative.",
    "I know I know, smoking's bad for me and all. But, my mama told me never to be a quitter.",
    "When I was young, I always felt like a male trapped in a females body. Then I was born",
    "3 men are stranded in a boat with 4 cigarettes and no way to light them. So they toss the 4th cigarette overboard, which makes the whole boat a cigarette lighter.",
    "As a wizard, I enjoy turning objects into a glass. Just wanted to make that clear.",
    "I'm reading a horror story in Braille. Something bad is about to happen... I can feel it.",
    "I recently got a new Korean mechanic but it's hard to understand him - he speaks with a Hyundai Accent!",
    "What happened when the semicolon broke grammar laws? It was given two consecutive sentences.",
    "The first time I got a universal remote control, I thought to myself \"This changes everything\".",
    "How can you spot the blind guy at the nudist colony? It's not hard.",
    "My buddy set me up on a blind date & said, \"Heads up, she's expecting a baby.\" Felt like an idiot sitting in the bar wearing just a diaper.",
    "I hate insects puns, they really bug me.",
    "I always wanted to marry an Archeologist. The older I would get, the more interested she would become!",
    "I'm changing my name to 'Benefits' on Facebook. Next time someone adds me, It will say \"you are now friends with Benefits.\"",
    "Finally got around to watching Back To The Future... It's about time.",
    "My computer's got Miley Virus. It has stopped twerking.",
    "Cleaning mirrors is a job I could really see myself doing.",
    "Why did the bee get married? Because he found his honey.",
    "I own a pencil that used to be owned by William Shakespeare, but he chewed it a lot. Now I can't tell if it's 2B or not 2B.",
    "How do trees access the internet? They log in.",
    "Every time I tell a punny cow joke, I butcher it.",
    "I've decided to sell my Hoover... well, it was just collecting dust.",
    "A hole was found in the wall of a nudist camp. The police are looking into it.",
    "I was going to give him a nasty look, but he already had one.",
    "Did you know that if you hold your ear up to a strangers leg you can actually hear them say \"what the fuck are you doing?",
    "Today, my son asked \"Can I have a book mark?\" and I burst into tears. 11 years old and he still doesn't know my name is Brian.",
    "Q: What do you call a cow with a twitch? A: \"Beef Jerky!\"",
    "What do you call a cow during an earthquake? A milkshake.",
    "Three conspiracy theorists walk into a bar. You can't tell me that's just a coincidence!",
    "I am so poor I can't even pay attention.",
    "I got a part in a movie called \"Cocaine\". I only have one line.",
    "What do you call Watson when Sherlock isn't around? Holmeless.",
    "I just found an origami porn channel, but it is paper view only.",
    "It's hard to explain puns to kleptomaniacs because they always take things literally.",
    "What do you call an academically successful slice of bread? An honor roll.",
    "The best time to open a gift is the present.",
    "My IQ test results just came in and I'm really relieved. Thank God it's negative.",
    "Anyone who wanted to sell fish had to get permission from grandpa. He was known as the cod father.",
    "I'm trying to date a philosophy professor, but she doesn't even know if I exist or not.",
    "What is the best Christmas present ever? A broken drum - you can't beat it!",
    "Why did the cross-eyed teacher lose her job? Because she couldn't control her pupils.",
    "What do sea monsters eat for lunch? Fish and ships.",
    "Did you hear about the math teacher who's afraid of negative numbers? He will stop at nothing to avoid them.",
    "What musical instrument is found in the bathroom? A tuba toothpaste.",
    "What is the name of an Asian pilot who died in a plane crash? Sum Ting Wong.",
    "I had a job tying sausages together, but I couldn't make ends meet.",
    "Isn't it scary that doctors call what they do \"practice\"?",
    "If Russians pronounce B's as V's then Soviet.",
    "Did you hear about the 2 silk worms in a race? It ended in a tie!",
    "Where do sick boats go to get healthy? To the dock!",
    "I have won first place in this Halloween costume contest 16 years in a row. This year I am dressed as a hotdog. I'm on a roll.",
    "I ran out of poker chips so used dry fruits for playing instead. People went nuts when they saw me raisin the stakes.",
    "Why doesn't the bike stand by itself? Because it's two tired.",
    "How does Moses make his tea? Hebrews it.",
    "What is a baptized Mexican called? Bean dip.",
    "I remember being in so much debt that I couldn't afford my electricity bills, it was a dark time.",
    "I used to wonder why Frisbees looked bigger the closer it came... Then it hit me!",
    "Do German cats have multiple lives? Nein.",
    "If the sun is so hot how come it's single.",
    "When is a door not a door? When it's ajar.",
    "Grandma's been staring through the window ever since it started to snow. If it gets any worse I'll have to let her in.",
    "How does a snowman get around? He rides an icicle!",
    "For Sale: Parachute. Only used once, never opened.",
    "My landlord says he needs to come talk to me about how high my heating bill is. I told him, \"My door is always open\".",
    "One bird can't make a pun. But toucan.",
    "Fishermen are reel men.",
    "The nurse at the sperm bank asked me if I'd like to masturbate in the cup. I said, \"Well, I'm pretty good, but I don't think I'm ready to compete just yet.\"",
    "What is the longest website domain name? smiles.com because there is a \"mile\" between the s's!",
    "I was going to share a vegetable joke but it's corny.",
    "No matter how much you push the envelope, it'll still be stationery.",
    "The doctor told his patient to stop using a Q-tip, but it went in one ear and out the other.",
    "If anything is possible, is it possible for something to be impossible?",
    "I used to work at a fire hydrant factory couldn't park nowhere near the place.",
    "I'm taking part in a stair climbing competition. Guess I better step up my game.",
    "What do ghosts serve for dessert? I Scream.",
    "A garage sale is actually a Garbage sale but the \"b\" is silent.",
    "I put the \"fun\" in dysfunctional. ",
    "Your gene pool could use a little chlorine.",
    "My dog used to chase people on a bike a lot. It got so bad, finally I had to take his bike away.",
    "Have you ever has sex while camping? It's fucking intents.",
    "What do you get when you cross a snoman and a vampire? Frost bite.",
    "How does a cup steal from you? He mugs you.",
    "What does \"reading comprehension\" even mean?",
    "Why did Martin Luther King Jr. boycott laundry detergent? Because it told him to keep his whites and colors separate.",
    "What underwear does clouds wear? Thunderwear!",
    "Hung a picture up on the wall the other day. Nailed it.",
    "I wear two pairs of pants when I go golfing. People always ask me why I do. I say, \"I wear two pants when's I golf just in case I get a hole-in-one.",
    "Why was the horse so happy? Because he lived in a stable environment.",
    "Why did the picture end up in jail? It was framed!",
    "My tennis opponent was not happy with my serve. He kept returning it.",
    "What if there were no hypothetical questions?",
    "Maybe it's not global warming. Maybe it's just planetary menopause.",
    "Warning: Dates in calendar are closer than they appear.",
    "Teachers who take class attendance are absent-minded.",
    "On the other hand, you have different fingers.",
    "What concert costs 45 cents? 50 Cent feat. Nickelback.",
    "I Googled \"how to start a wildfire\". I got 48,500 matches.",
    "Tim bought 2 goldfish and named them 1 and 2. If 1 died, he'll still have 2.",
    "Why don't cannibals eat clowns? They taste funny.",
    "What do you call a Russian procrastinator? Putinoff.",
    "What's the difference between a Harley and a vacuum cleaner? The position of the dirtbag.",
    "I cooked Pancakes this morning. I was thrilled but my kids weren't. Apparently, he was their favorite rabbit.",
    "A guy goes to a club; the bouncer stops him. \"No tie, no entry.\" He walks back to his car to find a tie. All he found were jumper cables so he puts them around his neck like a tie. He goes back and says \"How's this?\" The bouncer says \"I'll let you in, but don't start anything.\"",
    "What does a mathematician say when something goes wrong? Figures!",
    "Why was the tree excited about the future? It was ready to turn over a new leaf!",
    "Nobody ever asks how Coca-Cola is doing. It's always, \"Is Pepsi okay?\"",
    "Doctor: \"Sir, I'm afraid your DNA is backwards.\" Me: \"And?\"",
    "I tried to catch some fog, I mist.",
    "Why do Swedish warships have barcodes on them? So when they dock they can Scandinavian.",
    "Is it good or bad if your vacuum sucks?",
    "If the right side of the brain controls the left side of the body, then lefties are the only ones in their right mind.",
    "How do you make a fire with two sticks? Make sure one of them is a match!",
    "Where does the Easter Bunny go to eat pancakes? To IHOP, of course!",
    "What do you call a fake noodle? An Impasta!",
    "I sat next to a man on the park bench. He had 9 watches on one wrist and 5 in the other. I said man \"you sure do have a lot of time on your hands.\"",
    "My cross-eyed wife and I just got a divorce. We didn't see eye to eye. I also found out she was seeing someone on the side.",
    "What do you and your shower have in common? You both get wet when I turn you on.",
    "My Sister was crying so I asked her if she was having a cry-sis.",
    "A plateau is the highest form of flattery.",
    "Why are fish never good tennis players? They don't like getting close to the net.",
    "I can cut down a tree only using my vision. It's true! I saw it with my own eyes!",
    "STRESSED is just DESSERTS spelled backward.",
    "They say \"don't try this at home\" so I'm coming over to your house to try it...",
    "What did the vegan say? I made a big missed steak.",
    "At my job, I have 500 people under me. I'm a security guard at a cemetery.",
    "Which day do chickens hate the most? Friday.",
    "In democracy, it's your vote that counts. In feudalism, it's your count that votes.",
    "Zebras are just horses that escaped from prison.",
    "What do you get when you cross a joke with a rhetorical question?",
    "The kid drowned. All his mates showed up at his funeral with life jackets on. Because it's what he would've wanted.",
    "I'm very pleased with my new fridge magnet. So far I've got twelve fridges.",
    "My mother used to make me walk the plank when I was younger, we couldn't afford a dog.",
    "If zombies are attacking you, just invite them to a party! Nobody wants to kill the life of a party!",
    "What do people wear in a trench? Trench coats.",
    "My new girlfriend works at the Zoo. I think she is a keeper.",
    "If you run in front of a car you'll get tired, but if you run behind the car you'll get exhausted.",
    "People often ask me if my French jokes are immature... wee.",
    "Television is a medium because anything well done is rare.",
    "Why did the M&M go to school? Because he really wanted to be a Smartie!",
    "What did the tree say to autumn? Leaf me alone.",
    "I recently heard about a mannequin that lost all of his friends because he was so clothes minded!",
    "Cells multiply by dividing.",
    "The recipe said \"Set the oven to 180 degrees\" so I did, but now I can't open it because the door faces the wall.",
    "My girlfriend asked me to pass her the Chapstick and I accidentally passed her the Glue Stick! She still hasn't talked to me!",
    "Me: \"You said dress for the job you want.\" Boss: \"Give me my clothes back.\"",
    "Did you hear about the pessimist who hates German sausage? He always fears the Wurst.",
    "Do you know why I make puns? Because it's my respunsibility.",
    "An opinion without 3.14159 is just an onion.",
    "The person who invented the door knock won the No-bell prize.",
    "The artist thought his favourite paint had been stolen, but it was just a pigment of his imagination.",
    "I went to the sign store the other day but all they had were left-hand turn signs. I didn't buy one because I knew deep down it just wouldn't be right.",
    "I don't mean to brag but I'm helping a Nigerian Prince with a pretty serious financial matter. I can't really talk about it.",
    "I used to build stairs for a living, it's an up and down business.",
    "I made a graph of my past relationships. It has an ex axis and a why axis.",
    "Why do people become butchers? So they can meat people.",
    "Will glass coffins be a success? Remains to be seen.",
    "Went to quite a few stores to find the best prices for herbs... I think it was thyme well spent.",
    "Iron Man is a very confusing character. I know he's a guy but he could have been Fe Male.",
    "Tea is like F5 to me, it's refreshing.",
    "What's the king of all school supplies? The ruler.",
    "Why do women have cleaner minds than men? Because they change theirs more often.",
    "If the koreans cannot do it, they will tell you that they won do it.",
    "Why don't oysters share their pearls? Because they're shellfish.",
    "What do you call someone who is afraid of picnics? A basket case!",
    "It was a bleak day when we heard about the explosion down at the animal shelter... It was raining cats and dogs!",
    "Why did the duck get arrested? Because he was selling quack.",
    "How much did the butcher charge for his venison? A buck!",
    "I got a job in a health club, but they said I wasn't fit for the job.",
    "I work out almost every day. Friday I almost worked out, Saturday I almost worked out, Sunday I almost worked out...",
    "Did you hear about the vegan transgender? He was a herbefore.",
    "Electricity is dangerous. Shocking, ain't it?",
    "I would make jokes about the sea, but they are too deep.",
    "What's the best place to grow flowers in school?... In the kindergarden.",
    "I would give my right arm to be ambidextrous!",
    "The word 'possesses', possesses so many s's, that any one can't assess it without knowing 's', I guess !",
    "Sang the rainbow song in front of a police officer, got arrested for colourful language",
    "I used to be a boy trapped in a woman's body. But after 9 long months, I was finally born!",
    "Love is like a machine... sometimes you need a good screw to fix it.",
    "Tried watching The Neverending Story, couldn't finish it.",
    "Where do frogs deposit their money? In a river bank.",
    "Why did the broom get a poor grade in school? Because it was always sweeping during class!",
    "What nationality is Santa Claus? North Polish",
    "I trapped a couple of vegans in my basement. At least I think they're vegan. They keep shouting 'lettuce leaf!'",
    "I told my girlfriend she drew her eyebrows too high. She seemed looked.",
    "Why can't you take anything balloons say seriously? They're always full of hot air!",
    "What did the paper say to the pencil? You've got a good point!",
    "I do try to be empathetic and put myself in other people's shoes... but I have big feet.",
    "What happened to the man who shoplifted a calendar on New Year's Eve? He got 12 months!",
    "Why can't you give Elsa a balloon? She will Let It Go!",
    "What do you call a mind reader who can't read minds? A telepathetic.",
    "I put a new freezer next to the refrigerator, now they're just chilling.",
    "I threw a boomerang many years ago. I now live in constant fear.",
    "Just got a job as senior director at Old McDonald's Farm. I'm the CIEIO.",
    "I've got a phobia of over-engineered buildings. It's a complex complex complex.",
    "Do skunks celebrate Valentine's Day? Sure, they're very scent-imental! ",
    "What did the blanket say when it fell off the bed? \"Oh sheet!\"",
    "Fixing broken windows is a pane in the glass.",
    "Why don't you ever see hippos hiding in trees? Because they are really good at it.",
    "Give a man a gun and he will rob a bank. Give a man a bank and he will rob everyone.",
    "Would you call an Italian hooker a pasta-tute?",
    "If 2 guys are having sex and the house catches on fire. Who gets out first, the guy on top or the guy on the bottom? The guy on the bottom cause he's already got his shit packed.",
    "Today a fortune cookie told me that every exit is an entrance. Long story short, my girlfriend said no.",
    "My dad used to say \"Always fight fire with fire.\" Probably explains why he was thrown out of the Fire Service.",
    "Did you hear about the hungry clock? It went back four seconds!",
    "Why did the lion broke up with his girlfriend? Because she was a cheetah!",
    "Why is a doctor always calm? Because it has a lot of patients.",
    "I could make jokes about fences, but they are offencive.",
    "Just gonna have a quick nap because I heard you can sleep your way to the top.",
    "I lost my paper towels, I think I need a bounty hunter.",
    "When is a field hockey player like a judge? When she sits on the bench.",
    "I wonder why there are locks on the doors of Seven-Eleven when it says they are open 24/7.",
    "Why are pigs so bad at soccer?  They are always hogging the ball!",
    "Just had a date with a woman who welds for a living and oh my, were the sparks flying.",
    "Can a kangaroo jump higher than a house? Of course, a house doesn't jump at all.",
    "I turned on the light to wake up my kids. My 2-year-old turned it off and went back to bed. She used to be the family alarm clock. Now she's the snooze button.",
    "My dog Minton ate all my shuttlecocks. Bad Minton.",
    "What do you call a bee that lives in America? A USB.",
    "What do you call the trousers of people who can't speak? Pant-O-Mimes!",
    "Why was the baseball player a bad sport? He stole third base and then went home!",
    "Why is a tennis game a noisy game? Because each player raises a racket.",
    "What is a lacrosse players favorite type of car? A dodge!",
    "What did the beach say as the tide came in? Long time no sea.",
    "Today I have met the vegetarian brother of Bruce Lee. Brocco Lee.",
    "How many tickles does it take to make an octopus laugh? Ten tickles.",
    "How did the chemist who failed the temperature test get? Absolute zero.",
    "My mother in law has a massive case of diarrhea. She won't find out until she gets home and unpacks her luggage...",
    "Heard about the pilot who decided to cook whilst flying? It was a recipe for disaster.",
    "Just saw a heavyset man carrying loads of weapons, even had one hanging out of his backside... it was big arse 'n' all.",
    "Just called to make an appointment with a psychic but she told me that I don't show up.",
    "I'm trying to finish writing a script for a porno movie, but there are just too many holes in the plot.",
    "What tea do hockey players drink? Penaltea!",
    "The last time I was inside a woman was when I went to the Statue of Liberty.",
    "Why was there thunder and lightning in the lab? The scientists were brainstorming!",
    "Why is the man who invests all your money called a broker?",
    "Fat Penguin. Excuse me?! I just wanted to say something that breaks the ice...",
    "Why did St. Patrick drive all the snakes out of Ireland? He couldn't afford plane fare.",
    "What did the dog say when he rubbed sandpaper on his tail? Rough, rough!",
    "Has anyone heard the news about a festival in the US where a girl got her head stuck on a truck oversized tailpipe? Apparently she was exhausted...",
    "Where does a fish go to borrow money? The loan shark!",
    "What do you call it when two transgender midgets have sex? Micro trans-action.",
    "I was at a climbing center the other day, but someone had stolen all the grips from the wall; honestly, you couldn't make it up.",
    "What do squirrels give for Valentine's Day? Forget-me-nuts. ",
    "Stories of untold sufferring never stay that way.",
    "What's red and bad for your teeth? A brick.",
    "There's safety in Numbers, but I prefer Deuteronomy.",
    "What do you call your sister if she only has one leg? Eileen.",
    "Why can't fishermen be generous? Because their business makes them sell fish!",
    "Whoever invented knock knock jokes should get a no bell prize.",
    "What's the difference between a bird and a fly? A: A bird can fly, but a fly can't bird.",
    "Where did the spaghetti and the sauce go dancing? The meatball!",
    "How do you make a pool table laugh? You reach into its pockets and tickle its balls.",
    " Why did the snowman smile? Because the snowblower is coming.",
    "How did Ben Franklin feel about discovering electricity? He was shocked!",
    "One time somebody said if I was an element, I'd be copper. Then someone else told me I'm tellurium. Does that mean I'm CuTe?",
    "What did Zelda tell Link when he couldn't open the door? TRIFORCE!",
    "Recently I heard about a vampire that was so mathematically challenged that he couldn't count Dracula!",
    "I need to stop drinking so much milk. It's an udder disgrace.",
    "I like to give people blank \"Thank you\" cards for their birthdays and then when they ask me what it's for I say, \"You'll thank me later!\"",
    "I bought the smallest Fitbit they've got because I wanna get fit but just a little bit.",
    "A magician turned his testicles into two chicken.",
    "I watched a really sad porn film the other day - it was a real tear-jerker.",
    "Why was Cinderella banned from playing sports? Because she always ran away from the ball.",
    "Why don't you do arithmetic in the jungle? Because if you add 4 + 4 you get ate!",
    "What is the difference between a unicorn and a carrot? One is a funny beast and the other is a bunny feast.",
    "I bought my son a fridge for Christmas. – I can't wait to see his face light up when he opens it.",
    "How did the soggy Easter Bunny dry himself? With a hare dryer!",
    "Two cheese trucks ran into each other. De brie was everywhere.",
    "What's the difference between a guitar and a fish? You can't tuna fish!",
    "What does a disappointed mama turkey tell her kids? If your father were to see you now, he would be turning over in his gravy!",
    "Where do you find a birthday present for a cat? In a cat-alogue!",
    "Why did the can crusher quit his job? Because it was soda pressing.",
    "I figure I might need a new kidney in 30 years, so I've decided to have a kid.",
    "Hitting birds is illegal and you get a big fine, I learned this when I kicked a pelican... I ended up footing a massive bill.",
    "What race is never run? A swimming race.",
    "Pay no attention to the elephant in the room: it's ir-elephant.",
    "What did the mother lion say to her cubs before dinner? \"Shall we prey!\"",
    "What do you call a girl standing in the middle of a tennis court? Annette.",
    "Who earns a living driving their customers away? A taxi driver!",
    "Why can't the bank keep a secret? It has too many tellers!",
    "I have only seen people underwhelmed or overwhelmed, never whelmed properly...",
    "Why was Cinderella such a bad field hockey player? Her coach was a pumpkin.",
    "What did the little mountain say to the big mountain? Hi Cliff!",
    "What was the barristas favourite part about being arrested? The mug shots.",
    "If The Weekend canceled his tour, would it be next Weekend, the Weekend after next or three Weekends from this Saturday?",
    "What do you do with a sick chemist? If you can't helium then you curium and you barium.",
    "Why did the turkey play drums in his band? Because he already had drumsticks!",
    "How do you embarrass an archeologist? Give him a used tampon and ask him which period it came from.",
    "Hackers brought down my online business but I managed to keep the website address and that's domain thing.",
    "What do you call a monkey with a gun? Gorillawarfare.",
    "Why shouldn't you make fun of a paleontologist? Because you will get Jurasskicked.",
    "I was so sad and crying when I lost my playstation 3 but unfortunately, there was nobody to console me!",
    "Class trip to the Coca-Cola factory today. I hope there's no pop quiz.",
    "I hate school and got caught skipping the other day. My principal said, \"Walk normal next time, you fruitcake.\"",
    "Where did the baseball keep its lemonade? In the pitcher!",
    "Why did the lady sing lullabies to her purse? She wanted a sleeping bag!",
    "Why did the Investigator question the flat iron? To straighten things out.",
    "What did Cinderella say when her photos did not show up? Someday my prints will come!",
    "I once worked as a salesman and was very independent; I took orders from no one.",
    "Why did the Easter egg hide? Because he was a little chicken!",
    "How do astronomers organize a party? They planet.",
    "I like using misdirection in my jokes, or do I?",
    "What kind of cookies make you rich? Fortune cookies!",
    "Why did the girl wear glasses in math class? It improves di-vision.",
    "Why is Kevin Spacey so bad at Hide and Seek? He comes out at the wrong time.",
    "What do you call an Italian beggar? Giovanni change.",
    "Shocked by the Sears news today, I had no idea it was still open.",
    "My ex used to hit me with stringed instruments. If only I had known about her history of violins.",
    "I always wanted to learn to procrastinate... just never got around to it.",
    "Santa's elves are just a bunch of subordinate Clauses.",
    "What do you call a gay scientist? A homo-geneous.",
    "Chinese takeaway - £27.50. Petrol to get there - £3.25. Getting home then realizing they didn't give you one of the containers - riceless...",
    "What do you call a horse who expresses negative views? A Naysayer.",
    "I always wanted to marry Mrs. Right, but I didn't know her first name was \"Always\".",
    "Virginity is like a soapbubble, one prick and it is gone.",
    "I work in a library. Literally, all we do is judge books by their covers.",
    "If you cross an owl and a rooster, do you get a cock that stays up all night?",
    "What do you call a fish with no eye? FSH",
    "Q: what did one lumber jack say to another lumber jack? A: \"I need to axe you a question.\"",
    "My pencil is gone. It's pointless though.",
    "Saying \"super size it\" at the drive-thru doesn't work when it's a pharmacy.",
    "My midget friend got thrown out of the nudist colony because he kept getting in everyone's hair.",
    "You know why there aren't any good science puns nowadays? Because all the good ones argon.",
    "I took a viagra the other day. It got caught in my throat and all I ended up with was a stiff neck.",
    "I find it very offensive when people get easily offended.",
    "Did you hear about the guy who choked on a pretzel? He was very salty.",
    "Why didn't the skeleton go to prom? Cause he had 'no body' to dance with.",
    "What is the best way to communicate with a fish? Drop it a line!",
    "Should I have another baby after 35? No, 35 children are enough.",
    "I used to work at a company called 69, my friend took over my position.",
    "I would make a joke about Shrek, but they are too ogre-used.",
    "A life in politics is full of parties.",
    "I truly hope there is a stairway to heaven because I have a fear of elevators...",
    "Why do soccer players do so well in math? They know how to use their heads!",
    "A donkey fell into a bowl of sugar. Now that's a sweet ass.",
    "Here's a step by step guide to walking up the stairs, step 1) Right foot, step 2) Left foot, step 3) Right foot...",
    "Me: \"Remember when I rubbed you out?\" Genie: \"Don't say it like that...\"",
    "What do you call a girl with an hourglass figure? A waist of time.",
    "When I first started dating my wife she asked me what some of my dreams were. I told her one was about a T-Rex who didn't get a job because he couldn't tie a tie. She meant goals",
    "If there was someone selling drugs in this place, weed know.",
    "If your parachute won't open, you have the rest of your life to fix it.",
    "Why is a baseball game a good place to go on a hot day? Because there are lots of fans.",
    "Why did the volleyball players go to the library for practice? The coach told them they'll be doing some reading today.",
    "What did the hurricane say to the palm tree? Better hold onto your nuts because this is no ordinary blowjob.",
    "Hi, I'm a geologist - I was wondering if I could explore your natural resources...",
    "What fruit do you eat when you are sad? Blueberries.",
    "To the guy who invented the number zero: \"Thanks for nothing\".",
    "I cropped my kids out of my online dating profile photos. They can find their own dates.",
    "I watched a documentary on LSD last night, it really changed my perception.",
    "What do you call an alligator in a vest? An investigator!",
    "Why was it so hot in the stadium after the baseball game? All the fans left!",
    "To the women who say \"Men are only interested in one thing.\" Have you ever considered being more interesting?",
    "What do you call it when worms take over the world? Global Worming!",
    "What's the best thing to put into a pie? Your teeth!",
    "What kind of tan did pilgrims get to the beach? Puritan.",
    "If a dog was a computer, would its bark be bigger than its byte?",
    "I've never enjoyed my surprise birthday parties because all I can think about is how good my friends are at lying to my face.",
    "What does a cow say to bull? Are you always that horn-ny!",
    "How did two oceans or seas become friends? Because they kept waving at each other.",
    "I got fired from Yankee candle factory because I refused to work wick ends!",
    "I was going to be an optometrist, but couldn't see things clearly.",
    "What do you call cheese that is not yours? Nacho cheese!",
    "Where is the first tennis match mentioned in the Bible? When Joseph served in Pharaoh's court.",
    "What did one pencil say to the other pencil? You're looking sharp!",
    "When plumbers sleep do they have pipe dreams?",
    "Why do people litter? Because they dont take the litter signs litterally.",
    "Friends are like boobs. Some big,some small. Some real, some fake.",
    "What is the hardest thing about being a man? His penis.",
    "What kind of fish can't swim? A dead one.",
    "Why is Peter Pan always flying? He neverlands.",
    "Sometimes, when I'm cruising the city in a $200K vehicle, I lean back and think, \"If the bus driver doesn't speed up I'll be late for work.\"",
    "Why was tiger looking inside the toilet? He was looking for Pooh!",
    "What kind of candy is never on time? ChocoLATE!",
    "Why did the teacher jump into the water? She wanted to test the water!",
    "Why do field hockey players never sweat? They have too many fans!",
    "How did Superman's enemies do him in? They put him in his crypt tonite!",
    "Accidentally fell asleep smoking an e-cigarette and when I woke up my whole house was on the internet.",
    "Where do sharks go on summer vacation? Finland!",
    "Why shouldn't you tell an egg a joke? Because it might crack up!",
    "She said I wanna look bomb in the party. I said don't worry, we'll have a blast.",
    "What is the most dangerous thing in your freezer? Ice is.",
    "This morning my alarm went off, I thought it's sell-by date was tomorrow.",
    "Why did the scarecrow win the competition? He was 'outstanding' in his field!",
    "Why don't animals play poker in Africa? Because they're cheetahs.",
    "Bugs come in through open Windows.",
    "Well, just told the Starbucks barista my name is \"No War in Syria\". I know it's not much, but I hope it helps.",
    "Everyone has their own path, fortunately mine leads to the liquor store.",
    "What's the best place to shop for a soccer shirt? New Jersey!",
    "Why did Michael's grades drop after the holidays? Because everything was marked down!",
    "I asked my friend a question while he was eating an orange, but all I got was a pithy response.",
    "I just got this sick job at the Calendar factory. Unfortunately, I still can't get a date.",
    "I thought I understood the meaning of \"When Pigs Fly\" but then... the swine flu.",
    "When I told my family I wanted to do stand-up comedy all they did was laughing.",
    "What do crabs smoke? Seaweed.",
    "My son came home as I was taking his door off its hinges and asked: \"Dad what are you doing?\" I said, \"We've updated our privacy policy.\"",
    "What idiot called it a vet instead of a dogtor?",
    "Why are there 5 syllables in the word \"monosyllabic\"?",
    "I caught my neighborhood stealing my red food dye... When he was caught red handed he said \"I'm gonna dye\".",
    "Why are bad school grades like a shipwreck in the Arctic Ocean? They're both below C level!",
    "I'm never smoking weed with immigrants again. I asked \"Anyone have any papers?\" and they all ran like fuck.",
    "Why are cats, bad storytellers? Because they only have one tale.",
    "What goes through towns, up hills, and down hills but never moves? The road!",
    "One day we shall wake up together: me and my money.",
    "What's a horse's favorite sport? Stable Tennis.",
    "I used to have an open mind but my brains kept falling out.",
    "A man got hit in the head with a can of Coke, but he was alright because it was a soft drink.",
    "PMS jokes aren't funny. Period.",
    "Why did the octopus beat the shark in a fight? Because the octopus was well armed.",
    "Why is it not good to play tennis in a court? Because you might get arrested.",
    "Why do cows have hooves instead of feet? Because of the lactose.",
    "What do ghosts read? Booooks!",
    "What did the farmer say when his hay started blowing away? Hay, come back!",
    "I once dated a mime. I hope I left her with a good impression.",
    "Best math book never written: \"High School Math\" by Cal Q. Luss",
    "What is an alien's favorite candy? A Mars bar!",
    "I may not be Fred Flintstone but I can make your bed rock.",
    "A liberal is a conservative who's been arrested. A conservative is a liberal who's been mugged.",
    "Where do ghosts play tennis? On a tennis corpse!",
    "I should have known that my marriage was bound to be doomed when my wife choose to have her vows be read from the Necronomicom.",
    "What is Mozart doing right now? Decomposing.",
    "What did the pirate say when he found someone? I sea you!",
    "The Bermuda Triangle got tired of warm weather. It moved to Finland. Now Santa Claus is missing.",
    "I asked my pilot if he'd be okay having sex with me on our flight. He replied, \"I don't give a flying fuck.\"",
    "Did you hear the story about the giraffe? Forget it its too long.",
    "Happy birthday, Bono. I wanted to get you the perfect present, but I still haven't found what I'm looking for.",
    "Why did the slave go to college? To pick up his master's degree.",
    "The other day I was singing in the shower, and I got soap in my mouth. Guess what happened then? It became a soap opera.",
    "I can't jump over a cow, but you should check out my calves.",
    "Insects puns bug me.",
    "My colleague can no longer attend next weeks Innuendo Seminar so I have to fill her slot instead.",
    "What do you call a knife in Japan? A Santoku!",
    "The worst thing about having a ghost in your house is the douchey ghost hunters.",
    "Why are badminton players so loud? Because they are always making a racket!",
    "Why should you wary of stairs? Because they are always up to something.",
    "\"Hey Dad, have you seen my sunglasses?\" \"No son, have you seen my glasses?\"",
    "My dad was a stalker. I want to follow him in his footsteps.",
    "Some species of frog can jump higher than a 3-story office building. It's because of their immensely powerful hind legs, and the fact that office buildings cannot jump.",
    "What kind of car does Jesus drive? A Christler.",
    "What's a sexoholic's favorite roller coaster? Iron Rattler.",
    "How do you get a couple of fat birds into bed? Piece of cake.",
    "What do you get when you mix a cheetah and a hamburger? Fastfood!",
    "What's the difference between a knife and a feminist? The knife has a point.",
    "Wow, that was embarrassing. I opened my fridge and saw my salad dressing.",
    "Why did the volleyball player cross the road? There are players on the other side.",
    "Why is a bra singular and panties plural?",
    "Girl, are you a modern day savings account because I keep investing money in you but I'm not getting much interest.",
    "My friends laughed at me when I told them I had a hot date and they said she was imaginary. Well the jokes on them – they're imaginary too.",
    "If you ever get cold, just stand in the corner of a room for a while. They're normally around 90 degrees.",
    "What do you call dog meat? Pet food.",
    "Why did the belt get arrested? Because it held up a pair of pants!",
    "\"Give it to me! Give it to me!\" she yelled, \"I'm so wet, give it to me now!\" She could scream all she wanted to. I was keeping the umbrella.",
    "What did the big chimney say to the little chimney? \"You're too young to smoke.\"",
    "What do you call a frog stuck in mud? Unhoppy.",
    "If you are having a blind date on a glacier. Don't break the ice.",
    "Why are spiders great tennis players? Cause they have great topspin.",
    "I used to a fan of evolution. But then I have evolved.",
    "Who doesn't eat on Thanksgiving? A turkey because it is always stuffed.",
    "Nothing is impossible. The word itself says \"I'm possible.\"",
    "What dog can't bark? A hot dog.",
    "What do you call a mama cat? Tittycat!",
    "Best Summer Vacation Book Never Written: \"Where to Stay on Vacation\" by Moe Tell.",
    "Why did the robot go on summer vacation? He needed to recharge his batteries.",
    "I was going to my friend's place but accidentally walked into the wrong house. Turns out it was an orgy. Didn't see that cumming!",
    "Sex on tv can't hurt unless you fall off.",
    "I'm no weatherman but I know you're going to get 3 inches tonight.",
    "I wanted to make a joke about criminals, but I was scared it would get stolen.",
    "Where do fish work? The offish.",
    "Wanna fork? Not to-knife, but as spoon as I feel better.",
    "I spy with my little eye nothing because I only have two normal-sized eyes.",
    "What did one squirrel say to the other? Come around the tree and I'll show you my nuts.",
    "What is Whitney Houston's favorite type of coordination? Hand-eye.",
    "Why can't you play badminton in the jungle? Because there are too many cheetahs.",
    "I took my new car back to the dealers, complaining it only did left turns - \"drive in the opposite direction then\" he said.",
    "Where do zombies like to go swimming? The Dead Sea.",
    "Did you hear the joke about the Liberty Bell? Yeah, it cracked me up!",
    "I think it'd be cool if they made those classical nude sculptures out of timber instead of stone, wooden tit?",
    "Political parties are like toilet paper. Whichever side you select, you end up getting poop!",
    "Damn girl, are you a smoke detector? Cause you're annoying and won't shut the fuck up.",
    "What did the pig say at the beach on a hot summer's day? I'm bacon!",
    "What did Spartacus do to the cannibal who ate his nagging wife? Nothing, he's gladiator.",
    "I'd call someone pregnant \"totally fucked\".",
    "I once dated a woman who uses a nightlight. What a turn off.",
    "Walruses are like Tupperware - they both like a tight seal.",
    "I'd tell a joke about claustrophobic people, but it might be to tight for you.",
    "What do you call a mountain where people never sleep? Mt Neverest.",
    "What sound does a train make when it's eating?... Chew chew... Very Punny right?",
    "The early bird gets the worm but the late worm gets to live.",
    "Pork and Leek... great flavor for sausages... lousy brand name for condoms.",
    "Marriage through the ages creates new reflexive responses, for example it was only the other night the wife panted that she was so very hot, so I turned on the airconditioner.",
    "I wanted to be an astronaut but my parents told me the sky was the limit.",
    "What part of your family can you see through? A transparent.",
    "Did you hear about the athlete who wore two jackets when she painted the house? The instructions on the can said: \"Put on two coats.\"",
    "I went geese hunting the other day but once they started flying I knew the game was up.",
    "What do you call a snake that's exactly 3.14 meters long? A πthon.",
    "Didn't go to Church today, instead, I stayed at home and listened to REM. Guess I'm losing my religion.",
    "What do you call a owl that does magic tricks? Hoodini.",
    "Did you hear about the female rapper who only battled while she was on her menstrual cycle? They say she had a mean flow.",
    "What did the math book say to the psychologist? \"Would you like to hear my problems?\"",
    "They call me coffee cause I grind so fine.",
    "Where do bad gymnasts go? Behind parallel bars!",
    "You can't live, without, your... liver",
    "What did Mister A say to Mister E? It's the popular mystery.",
    "If we're going to arm the teachers at least give the librarians silencers.",
    "Whenever I get on my roof to clean the gutters, I always slip and fall. Every shingle time.",
    "My hope for you is that you someday find the end of your sentence",
    "I started a company selling landmines that look like prayer mats. Prophets are going through the roof.",
    "My friend's in prison for flashing; he says he can't bare it anymore.",
    "What is Al Caedas favorite football team? The New York Jets.",
    "I was raped by a group of mimes. They did unspeakable things to me.",
    "Are you from Japan? Cause I'm currently trying to get in japanties.",
    "The winner of the costume contest was the invisible man. He was invisible, and his wife wasn't much to look at either.",
    "The video from the ring infects people with airborne pathogens. The video went viral.",
    "Did you hear about the cannibal who dumped his girlfriend?",
    "What's brown and runny? Usain Bolt.",
    "Me: I know a gay guy that sounds like an owl. Friend: Who?",
    "She wanted to sell me a whole bedroom set, but I just wanted one nightstand.",
    "Why is a traffic light red? You would be red too if you were changing in front of people all day.",
    "My sister asked me to bring her something hard to write on. I don't know why she became so mad. It's pretty fucking hard to write on the sand.",
    "I slapped Dwayne Johnson's ass. I guess I've hit Rock Bottom.",
    "Why didn't the skeleton want to go to school? His heart wasn't in it.",
    "What is white when it's dirty and black when it's clean? A blackboard!",
    "Why was the broom late? It over swept!",
    "Why did the prawn leave the nightclub? Because he pulled a muscle.",
    "Is Japan looking for you? Cause you're on a whale watch.",
    "Why do Republicans spend so much money on bathroom fixtures? They really love the Grand Old Potty!",
    "Why were the Middle Ages called the Dark Ages? Because there were too many knights.",
    "I'd stand in a room amongst a group of people and say \"hey do you guys want to see a joke?\" Then walk out of the room, then walk back in whilst presenting myself in a grand fashion. \"Et voila.\"",
    "I'm in a long distance relationship, her restraining order ends tomorrow.",
    "What kind of bees make milk? Boobies",
    "I met the man who invented the windowsill. He's a ledge.",
    "What did the doctor say to the alcoholic? Keep taking the Pils.",
    "I would tell you a joke about my shoe but I think I shoedn't.",
    "Why did the boy throw the butter out the window? To see a butterfly.",
    "Eyelashes are supposed to prevent things from getting into your eyes but when I do have something in my eye it's always an eyelash. Eyeronic.",
    "What is a snowman's least favorite yoga position? Downward-facing dog pee.",
    "My honey farmer friend has a thing for big butts. I suppose Booty is in the eye of the bee-holder.",
    "How did the reporter kill himself? Noosepaper.",
    "What did the dentist said to the Sabretooth tiger? You have outstanding teeth.",
    "When there's a will, I want to be in it.",
    "What's the difference between a man and a woman? Don't think dirty! Only \"wo\".",
    "I heard that Michael Jackson loved his soda, so much so that they called him the King of Pop.",
    "I asked my friend for a sharpened pencil, but he didn't have one. I always knew he was a little dull...",
    "Word of the day is Legs. Now go spread the word.",
    "One wall to another... Meet you at the corner.",
    "My doctor wants to have me tested for lupus which is ridiculous, as I've never even seen a werewolf.",
    "Do you know how to lose weight... fast.",
    "What do you call a prostitute with a runny nose? Full.",
    "What do bullshitters like most about St. Patricks day? The blarney stone!",
    "Why did the farmer only wear one boot to town? He heard there would be a 50% chance of snow!",
    "I could make jokes about bears, but they are unbearable.",
    "Where does Napoleon keep his armies? In his sleevies.",
    "I was about to crack a joke on boxers; now leave it, I forgot the punchline.",
    "Vagina - the box a penis comes in.",
    "Why don't women want to get engaged on St Patricks Day? 'Cause they don't want to get a \"sham rock\".",
    "What do a dentist and a tennis coach have in common? They both use drills!",
    "I'm sure my neighbor Nicholas is trying to poison me... You're such an Arse, Nick.",
    "When do people start using their trampoline? Spring-Time.",
    "How do teddy bears keep their den cool in summer? They use bear conditioning!",
    "How many lights does it take to screw in a lightbulb? None, the light is already in the bulb.",
    "I hated my job at the fireworks factory, I got fired a lot.",
    "What type of exam does the vampire teacher give his students? A blood test.",
    "Putting your iPod on shuffle around your friends is like playing Russian roulette with their respect for you.",
    "You must be from Prague because I can't help but Czech you out.",
    "You must be some kind of weirdo to like The Doors. I guess People Are Strange.",
    "Doc says to the patient, \"You have the body of a twenty-year-old, but you should return it. You're stretching it completely out of shape.\"",
    "If you were a TSA agent, I would be happy to get a body scan.",
    "We shouldn't make fun of fat people because they already have enough on their plate.",
    "Can February March? No, but April May!",
    "Why can't pigs tell a joke? Because they're such a bore.",
    "Can't throw the ball, kept on bouncing away: situation is out of hand.",
    "What is the difference between frustration and satisfaction? \"What the Fuck!\" and \"What a Fuck!\"",
    "Get stoned. Drink wet cement.",
    "What is it? \"It\" is a pronoun.",
    "I am the ghost of Christmas Future Perfect Subjunctive: I will show you what would have happened were you not to have changed your ways!",
    "What do cannibals do at a wedding? Toast the bride and groom.",
    "Chem students do it on the table periodically.",
    "What do you call a dog on the beach in the Summer? A hot dog!",
    "Stephen Hawking has a great sense of humor. He does One-liners, but not a Stand-up comedy.",
    "I'm not racist, I have a colored tv.",
    "Party host: Anyone here allergic to nuts? Because I like to rest mine on the table.",
    "Opinions are like arse holes. Everyone has one, but not everyone wants to hear it...",
    "What do bees do with their honey? They cell it.",
    "Why did the lady wear a helmet every time she ate? She was on a crash diet!",
    "Are you Vietnamese? Cause I'm falling pho you.",
    "Had to turn the stereo off, my wife has been playing Depeche Mode all day. She just can't get enough, whilst I just enjoy the silence.",
    "He's so far in the closet, he can see Narnia.",
    "How do you prevent a Summer cold? Catch it in the Winter!",
    "I just drank a monster energy drink and I'm still depressed but like, excitedly.",
    "What do elves learn in school? The Elf-abet! ",
    "PewdDePie, I used to be a fan but now I am a air conditioner.",
    "I just created a new assembler for the ladies only. It is named \"Org-asm\".",
    "What did the jester say to the criminal at the guillotine? \"Stay calm, and do not lose your head.\"",
    "Are you a Disney princess? Cuz your Cinder-hella-fine.",
    "When do monkeys fall from the sky? During Ape-ril showers!",
    "What's the hardest thing about dating a blind woman? Getting her husband's voice just right.",
    "What is a math teacher's favorite sum? Summer!",
    "Isn't it annoying when engineering students call themselves engineers? You don't hear medical students calling themselves doctors or art students calling themselves baristas.",
    "A rolling stone... somebody pushed it.",
    "I thought about my ex-girlfriend today, then I wiped my ads and flushed the toilet.",
    "What are the 2 reasons the girl broke up with her boyfriend? Because he was a cheetah and because he was lion too much to her.",
    "What is black and white and red all over? A newspaper!",
    "Why can't ghost have babies? Because they have Halloweenies.",
    "What's the difference between a politician and a flying pig? The letter F.",
    "What's most interesting song? My girlfriend 's fart.",
    "The plumber told me a hole boring story about pipes.",
    "Math puns are the first sine of madness!",
    "I do not know why some people don't finish their sentences, like it's really annoying...",
    "My girlfriend just dumped me for talking too much about video games. What a ridiculous thing to fallout 4.",
    "Jokes about unemployed people are not funny. They just don't work.",
    "What do computers eat for a snack? Microchips!",
    "Condoms are for fucking pussies.",
    "My patience has stretch marks.",
    "I would tell a swimming joke, but I think it's too watered-down to be funny.",
    "I have given up on my stand up comedy routines. Everybody just keeps laughing at me.",
    "What did the Zero say to the Eight? Nice belt!",
    "Why does the alcoholic Avon lady walk funny? Because her lips stick.",
    "I used to be a lifeguard, but this blue kid got me fired.",
    "What's better than roses on your piano? Tulips on your organ.",
    "I once hit a bat with a bat.",
    "Is the last thing that Tickle Me Elmo gets before leaving the factory two test tickles?",
    "What do you call a dead Magician? A ABRACADAVA.",
    "English is weird. It can be understood through tough thorough thought, though.",
    "I went to a party and met apple there. I asked him to buy me a vodka, but Damn! He gave me a fruit punch.",
    "Why do people wear shamrocks on St. Patrick's Day? Regular rocks are too heavy.",
    "To all the Dads out there, Happy Father's Day... you mother fuckers.",
    "Why should you not make fun of a crippled person? Because he can't stand the jokes.",
    "Why do people ask me if I'm \"hiding\", if I was hiding you wouldn't see me!",
    "Exaggerations went up by a million percent last year.",
    "The Italian boxing team boycotted the Olympics when they heard it was going to be one on one.",
    "My wife had her period at a Manchester United game, and all I got was this bloody t-shirt.",
    "Why did the snowman's daughter become a stripper? Because he was so cold to her.",
    "Why did the librarian get kicked off the plane? Because it was overbooked.",
    "USA's been so good at the Olympics, it's trumped the rest!",
    "Lately I've been trying to touch my toes, which I don't find so complicated, but my knees just can't get it straight.",
    "What do you call a black baby pig? A niglett.",
    "Your lips are the whitest I've come across.",
    "Two blondes were driving to Disneyland. The sign said, \"Disneyland Left\". So they started crying and went home.",
    "A Roman fighter consumed his wife. He said he was glad 'e ate 'er...",
    "Murdered for immortality. Received life sentence.",
    "What happened when an icicle landed on the snowman's head? It knocked him out cold.",
    "Did you hear about the man who was accidentally buried alive? It was a grave mistake.",
    "A waist is a terrible thing to mind.",
    "If I was addicted to masturbation, and then became addicted to sex, would it be safe to say that my addiction got out of hand?",
    "Did you hear they banned fans from doing \"The Wave\" at all sports events? Too many blondes were drowning.",
    "At school I graduated second to a lamp, he was too bright for me.",
    "How does broccoli use a cellphone? He cauliflower.",
    "Was invited to a birthday party last evening but didn't have a Blast. Hardly any Bombs!",
    "What's the difference between a sidewalk, a drug dealer, and a prostitute? Sidewalks crack doesn't leave an odor!",
    "I'm not a Nazi I'm just asking if Jew mad, cause I'm führerious!",
    "What do you call Dinner and Breakfast? Dickfeast!",
    "\"Orion's Belt is a big waist of space.\" Terrible joke. Only three stars.",
    "Just stayed a night in the YMCA... I don't want to make a song and dance of it.",
    "Why does Santa Claus have such a big sack? He only comes once a year.",
    "What does a hockey player and a magician have in common? Both do hat tricks!",
    "I swear to drunk I'm not God, but seriously, stay in drugs, eat school, and don't do vegetables.",
    "What do you call a snowman orgy? A snowball fight.",
    "I would tell a history joke, but they're too old fashioned.",
    "Hear about the new drug for lesbians? Trycocksagain.",
    "What did one boob say to the other boob? You are my breast friend!",
    "Why do birds fly south in the Fall? Because it's too far to walk.",
    "What is the cheapest meat you can buy? Deer balls. There under a buck.",
    "NASA is sending traditionalist Christians to the red planet... Amish on to Mars.",
    "What do you call a bird at a party? A party fowl.",
    "What did the Asian parent say during the DNA test? That's Yu!",
    "Why can't blind people eat fish? Because it's sea food.",
    "Black magic.... It doesn't work.",
    "I don't believe in myths like the one that states you have a brain.",
    "Tried to make a joke about putting Marijuana in the Dryer... All I got was Tumbleweed.",
    "My girlfriend told me she wanted to be treated like a princess. So I put her in the back of a Mercedes and drove into a wall.",
    "What would you get if you crossed Christmas with St. Patrick's Day? St. O'Claus!",
    "Why do dogs make good sailors? They know their knots.",
    "Why is Justing Bieber like a shotgun? Give him a cock and he will blow!",
    "Why did the lady snowman divorce her husband? She found out he was going to a snow blower.",
    "Ever have sex while camping? Take my word when I say it's fucking intents.",
    "Why did the summer school teacher wear sunglasses? Because her class was so bright!",
    "What did the Mexican man say when his house fell on him? Get off me homes.",
    "What do you call a 5-gallon drum stuffed full of white people? A cracker barrel.",
    "What do Michelangelo and Kurt Cobain have in common? They both used their brains to paint the ceiling.",
    "What day does an Easter egg hate the most? Fry-days.",
    "I called in sick this morning on account of diarrhea. My boss told me to get my shit together.",
    "How do you get Pikachu onto the bus? You Pokemon.",
    "People with diarrhea don't have their shit together.",
    "What's the difference between an Aussie and a Yoghurt? A Yoghurt's got culture!",
    "My girlfriend broke up with me because I stole her wheelchair.  I knew she'd come crawling back to me.",
    "Why was the blonde so disappointed when she got her license? She had gotten an F in sex!",
    "Why do Eskimos build Igloos with a hole out front? So you can see Inuit.",
    "Seminar \"How to avoid frauds\" is canceled. Tickets are non-refundable.",
    "My mate broke his left arm and left leg, but he was alright.",
    "My boss touched me inappropriately at work today. It's okay though, I'm self-employed.",
    "I like to have a Frappuccino each morning with my Breakfast... I'm a Cereal Frapist.",
    "Why did the downhill skier take off all his clothes? Because he wanted to get windblown.",
    "Oh no! Help! I'm under a tack!",
    "My friend stopped by to tell me he had just been diagnosed as Dyslexic. Said he was going home to write it in his dairy.",
    "What is a runner's favourite subject in school? Jog-raphy!",
    "Why is a blonde like a railway track? She gets laid all over the country.",
    "A magician was driving down the road and turned into a shopping mall.",
    "Trump invited Putin to Washington because it's customary to take a tour of your new home before you move in.",
    "Why do I always know where to go when I am canoeing? Because I \"canoe\" it.",
    "I've got a new anorexic girlfriend. It's not going too well though. I'm just seeing less and less of her...",
    "I drink straight out a of the wine bottle while cooking. I think that's what they mean by reducing it.",
    "What did the boy cat say to the girl cat on Valentine's Day? You're purrr-fect for me!",
    "What's a crocodile's favorite shoe? A Crocs.",
    "Did you hear about the bonfire? I heard it was lit.",
    "Ice-T was diagnosed with Parkinsons. Now he's using the stage name Chocolate Shake.",
    "Did you hear about the gay guy who got kicked off the golf course? He was playing with too many strokes.",
    "Did you hear about the tailor who shredded all the neckwear? His company severed all ties.",
    "Relationship between men and women is psychological. She is psycho and he is logical.",
    "I once crashed into a cow pasture. I was in for a beef of trouble.",
    "What did Donald Trump say to Dora The Explorer while playing Uno? \"Ok, you tortilla stop jumping and stealing all the green cards.\"",
    "No checks (Czechs are welcome).",
    "I thought it was my birthday cake but it was just the shed on fire.",
    "What cake makes you feel uncomfortable? Stomachache.",
    "Have you ever tried camping sex? No, well its fucking in tents!",
    "What sound does a bouncing plane make? Boeing.",
    "Why did the chicken cross the Möbius strip? To get to the same side!",
    "The girls in my local strip club are so good with computers they do lap top dancing.",
    "My take home pay won't even get me home.",
    "You know those people using bibles on their phones? They are using phony bibles.",
    "What's the origin of the word \"Boob\"? The \"B\" is the aerial view, the \"oo\" is the front view, the \"b\" is the side view.",
    "What did one telephone say to another? \"You are too young to be engaged!\"",
    "They are doing a sequel to Finding Dory where she discovers she has cancer and searches for a cure. It's called Finding Chemo.",
    "A lorry-load of tortoises crashed into a trainload of terrapins, I thought \"That's a turtle disaster\".",
    "What's the only drink size they allow in North Korea? A supreme liter.",
    "Why did the chink fail his blood test? He didn't study!",
    "Where do snowmen go to donate their sperm? The snowbank.",
    "I need some band-aids I'm getting cut from all this working out.",
    "Where do cows go on their summer vacation? Moo York.",
    "What do perverted leprechauns drink on St. Patricks Day? Mount & Do.",
    "How do you get off a non-stop flight?",
    "What do you call a mexican rolling in sand? A churro.",
    "Why did the female snowman delete Tinder? She was getting too many snow cone pics.",
    "I hope you like beef because we will eat that when we meat.",
    "If my puns are cheesy, then they would go well with crackers.",
    "Someone broke into my house and stole my external hard drive; they really got my backup.",
    "Did you hear about the 2 gay men that got into a fight in a bar? They were ejected for exchanging blows.",
    "Beauty is in the eye of the beer holder.",
    "Why did the snowman take his pants off? Because he saw the snowblower coming.",
    "Why do gay men fake orgasms? Because they will be in deep shit if they don't!",
    "I went to school without my shoes today. I got shoe-spended for a week.",
    "What summer vacation destination makes a pet bird sing for joy? The Canary Islands!",
    "My friend told me he had a sister. I asked if she was hot and he said she was 8. That wasn't my question.",
    "What medical condition does a person have if the shoot all the bullets out the mag, then tries to shoot the enemy and forgets he shoot all the bullets. Ammoneisa.",
    "I hate going on the road, it Drives me crazy.",
    "She asked if I had my shit together yet? I said of course, cause no one wants a man with Diarrhea.",
    "Why are Vegan women, hypocrites? Cause they love to bone and eat meat!",
    "There is 1 thing 2 do 3 words 4 you I LOVE YOU.",
    "War does not determine who is right – only who is left.",
    "Easy to Easy is not easy.",
    "What's the difference between a Jew and a bullet? The bullet gets out of the chamber.",
    "Why did the chicken cross the road? Because KFC was on the other side.",
    "What do you buy a friend graduating from Law School? A law-botomy.",
    "The other day I stopped to pick buttercups, what buttocks were doing on the floor I don't know.",
    "Swallowing your babies is fatal.",
    "Just finished building the deepest well in England. Got the plans wrong way round, started work on the tallest lighthouse.",
    "I've seen a turkey but I've never been to Turkey.",
    "There was an outbreak of food poisoning among the world leaders at the recent summit. During the food preparation, they feared what the Russians Putin May Merkel Trump.",
    "Other people don't like my queue jumping. Especially when I use my motorcycle.",
    "Did you hear about the monkey with a steak on his head, thought he was a grills?",
    "What do you do when you find out Viagra isn't working for you? You go Cialis!",
    "Sis wanted a cheese, I gave her D camera and told her to say cheese!",
    "What's the difference between batman and a black man? Batman can go into a store without robin.",
    "The next tropical cyclone should be named after you. It would be less fatal than your face.",
    "Women were born to WOO MEN but why do they WOE MEN?",
    "What do you call a dictionary using meth? Addictionary.",
    "What do politicians and porn stars have most in common? They're experts at switching positions in front of camera.",
    "Sperm is white and pee is yellow so a man can tell if he's coming or going.",
    "What is a snowman's favorite sex position? Sled doggy-style.",
    "Why couldn't the toilet paper cross the road? Because it got stuck in a crack.",
    "Why did a woman include a bag of meth with her ATM transaction? She thought it would speed up her deposit!",
    "Two cows in a field. Which one is on holiday? The one with the week cave.",
    "Why did the prostitute retire? She screwed up!",
    "Just found out an acquaintance is a drug dealer, would never have guessed, seems like a nice, funny guy. He always cracked me up.",
    "It's better to have a bottle in front of me, than a frontal lobotomy.",
    "Why are most politicans in the closet or gay? Because they can only mandate.",
    "I refused to believe I was gay and dyslexics. I was in Daniel.",
    "If you wrote essay about chinese food,what would it call? Dogcument.",
    "Why do we laugh at female presidential candidates? Because they're Hillary-ous!",
    "Q: Why don't blacks fuck Afghans? A: Because they are going to make you blow.",
    "Did you hear about the homosexual electron? Went around blowing fuses.",
    "What do you call a gay dinosaur? Brontosoarass.",
    "Your mama got a eye in her ass talking about I see that shit.",
    "A man is walking through a graveyard when he sees another man squatting next to a grave. \"Morning!\" he calls out. \"No, just taking a shit!\"",
    "If you fuck \" P\" it would change to \" B \".",
    "I called the Child Abuse Hotline. A kid answered, called me a fat cunt, and told me to fuck off.",
    "Firefighters in London were called to assist hospital staff when a man's genital became trapped in a spanner. A hospital spokesman said the patient took a turn for the worse.",
    "I'm Muslim. In my last stand up I bombed. CIA is after me now.",
    "What is the difference between acne and a catholic priest? Acne usually comes on a boys face after he turns 12.",
    "My girlfriend just admitted she used to be a Christian, so I broke up with her. It might seem judgemental, but I have only known her since she was Christine.",
    "What does the Bermuda Triangle and blondes have in common? They've both swallowed a lot of seamen.",
    "What do you get when a black person and a samoan have kids? Sum mo niggaz.",
    "What do women and modern computers have in common? Neither one will accept a 3 and a half inch floppy.",
    "How can you tell if a novel is about a homosexual? The hero always gets his man in the end.",
    "I'm on a whiskey diet. I've lost three days already.",
    "Did you hear about the guy who got killed and cut into pieces and stuffed into a zipper bag? His lips were sealed.",
    "How did Jesus get in such good shape? Crossfit.",
    "What's the difference between Bill Clinton and a carpenter? A carpenter can cover up the holes he screws.",
    "I couldn't join the KKK if I wanted to, my bloodline isn't pure enough. Turns out my parents weren't even related.",
    "Anal sex does not make one's day it makes one's hole weak",
    "How much semen does a gay guy have? A butt load.",
    "I was going to ask my wife for anal... but fuck it.",
    "I lost my weed in a series of small fires.",
    "Why was the guitar teacher arrested? For fingering a minor.",
    "My girlfriend told me she was going to get pregnant and if wouldn't do it, she was going to the sperm bank! Boy, I gave her a mouth full!",
    "How did they know Princess Diana didn't have dandruff? Because they found her head and shoulders in the glove box.",
    "What do gay men call hemorrhoids? Speed Bumps.",
    "So Donald Trump walks into a bar... and lowers it.",
    "I don't mean to be forward girl but do you swallow? Ok Cool. Swallow these 7 balloons of Heroin and get on this flight to Los Angeles",
    "My gay friend got fired from the sperm bank because they caught him drinking on the job.",
    "What's a cocoon? Same as a n-nigger.",
    "What is the abbreviation of KFC: Killing Fucking Crackers?",
    "What does a homo say to another gay going on vacation? Can I help you pack your shit?",
    "What is a gay person's favorite desert on a hot day? Ass cream cones.",
    "It's amazing how one letter can change the whole meaning of a word, I once introduced myself as a racist, obviously meaning rapist.",
    "What do you call a Muslim who owns 6 goats? A pimp.",
    "What does one gay say to another homo sitting at the bar? \"Do you mind if I push in your stool?\""
]